protocol_tools/priv/OneNDS_addRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
 xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:urn="urn:siemens:names:prov:gw:SPML:2:0"
 xmlns:soap="http://soapadapter.provgw">
  <soapenv:Header />
  <soapenv:Body>
    <spml:addRequest
     xsi:schemaLocation="urn:siemens:names:prov:gw:SEVAS_SUBSCRIBER:1:0 sevas_subscriber-1.0.xsd"
     language="en_en"
     returnResultingObject="${returnResultingObject}"
     requestID="${RANDOM}-${RANDOM}-${RANDOM}"
     xmlns:spml="urn:siemens:names:prov:gw:SPML:2:0"
     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <version>SEVAS_SUBSCRIBER_v10</version>
      <object
       xsi:type="subscriber:Subscriber"
       xmlns:subscriber="urn:siemens:names:prov:gw:SEVAS_SUBSCRIBER:1:0">
        <identifier>${imsi}</identifier>
        <svProfile>
          <ban>113512662</ban>
          <billCycle>22</billCycle>
          <msisdn>${msisdn}</msisdn>
          <fupPolicy>725</fupPolicy>
          <imei>0</imei>
          <imsi>${imsi}</imsi>
          <infoService><infoSvcs>I2</infoSvcs></infoService>
          <infoService><infoSvcs>AUGC</infoSvcs></infoService>
          <infoService><infoSvcs>BBIB</infoSvcs></infoService>
          <infoService>
            <infoSvcs>CLONE ONE</infoSvcs>
            <infoSvcs>CLONE TWO</infoSvcs>
            <infoSvcs>CLONE THREE</infoSvcs>
          </infoService>
          <infoService><infoSvcs>FUP</infoSvcs></infoService>
          <infoService><infoSvcs>I0</infoSvcs></infoService>
          <infoService><infoSvcs>MISP</infoSvcs></infoService>
          <infoService><infoSvcs>MPTY</infoSvcs></infoService>
          <infoService><infoSvcs>SWAP</infoSvcs></infoService>
          <infoService><infoSvcs>WIBT</infoSvcs></infoService>
          <infoService><infoSvcs>WLIST</infoSvcs></infoService>
          <paymentMethod>postpay</paymentMethod>
          <pricePlan>X12M24D76</pricePlan>
          <rttChannel>wh</rttChannel>
          <voicemailCluster>1</voicemailCluster>
          <wholesalePartnerId>EEONE</wholesalePartnerId>
          <SSN>89443001043299046009</SSN>
          <tree><![CDATA[${tree_data}]]></tree>
        </svProfile>
      </object>
    </spml:addRequest>
  </soapenv:Body>
</soapenv:Envelope>
